plugins/discourse-subscriptions/spec/fixtures/json/stripe-price-list.json

{
  "object": "list",
  "data": [
    {
      "id": "price_1OrmlvEYXaQnncShNahrpKvA",
      "object": "price",
      "active": true,
      "billing_scheme": "per_unit",
      "created": 1709840311,
      "currency": "usd",
      "custom_unit_amount": null,
      "livemode": false,
      "lookup_key": null,
      "metadata": {
        "group_name": "subscribers",
        "trial_period_days": "0"
      },
      "nickname": "EA1",
      "product": {
        "id": "prod_PhB6IpGhEX14Hi",
        "object": "product",
        "active": true,
        "attributes": [

        ],
        "created": 1709840195,
        "default_price": null,
        "description": null,
        "images": [

        ],
        "livemode": false,
        "marketing_features": [

        ],
        "metadata": {
          "description": "Sign up and get access to an exclusive group of enthusiasts just like you!"
        },
        "name": "Exclusive Access",
        "package_dimensions": null,
        "shippable": null,
        "statement_descriptor": "TESTING",
        "tax_code": null,
        "type": "service",
        "unit_label": null,
        "updated": 1709840195,
        "url": null
      },
      "recurring": {
        "aggregate_usage": null,
        "interval": "month",
        "interval_count": 1,
        "meter": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "tax_behavior": "unspecified",
      "tiers_mode": null,
      "transform_quantity": null,
      "type": "recurring",
      "unit_amount": 1000,
      "unit_amount_decimal": "1000"
    }
  ],
  "has_more": false,
  "url": "/v1/prices"
}